## **Day 16 of 30 days Data Analysis**

### ***Creating a database and table:***

In [3]:
import sqlite3 
import pandas as pd

conn = sqlite3.connect("supermarket.db")
df = pd.read_csv("C:\\Users\\LENOVO\\Documents\\Programming\\30days_data_analysis\\week02_sql\\supermarket_d14.csv")
df.to_sql("transactions", conn, if_exists="replace", index=False)

1000

### ***Running a simple query output - shows the first 5 rows of the database:***

In [4]:
query = "SELECT * FROM transactions LIMIT 5;"
pd.read_sql(query, conn)

,Invoice ID,Branch,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Sales,Date,...,Payment_Credit card,Payment_Ewallet,City_Naypyitaw,City_Yangon,CustomerType_lbl,Year,Month,Day,Weekday,Hour
0,750-67-8428,Alex,0,Female,Health and beauty,74.69,7,26.1415,548.9715,2019-01-05,...,0,1,0,1,Member,2019,1,5,Saturday,13
1,226-31-3081,Giza,1,Female,Electronic accessories,15.28,5,3.8200,80.2200,2019-03-08,...,0,0,1,0,Normal,2019,3,8,Friday,10
2,631-41-3108,Alex,1,Female,Home and lifestyle,46.33,7,16.2155,340.5255,2019-03-03,...,1,0,0,1,Normal,2019,3,3,Sunday,13
3,123-19-1176,Alex,0,Female,Health and beauty,58.22,8,23.2880,489.0480,2019-01-27,...,0,1,0,1,Member,2019,1,27,Sunday,20
4,373-73-7910,Alex,0,Female,Sports and travel,86.31,7,30.2085,634.3785,2019-02-08,...,0,1,0,1,Member,2019,2,8,Friday,10

### ***Calculate total sales:***

In [5]:
query = "SELECT SUM(Sales) as Total_Sales FROM transactions;"
pd.read_sql(query, conn)

   Total_Sales
0   322966.749

### ***Sales by gender:***

In [6]:
query = """
SELECT Gender, SUM(Sales) as Total_Sales
FROM transactions
GROUP BY Gender
ORDER BY Total_Sales DESC;
"""
pd.read_sql(query, conn)

   Gender  Total_Sales
0  Female  194671.8375
1    Male  128294.9115

### ***Average reting each product line:***

In [10]:
query = """
SELECT [Product line], AVG(Rating) as Abg_Rating
FROM transactions
GROUP BY [Product line]
ORDER BY Abg_Rating DESC;
"""
pd.read_sql(query, conn)

             Product line  Abg_Rating
0      Food and beverages    7.113218
1     Fashion accessories    7.029213
2       Health and beauty    7.003289
3  Electronic accessories    6.924706
4       Sports and travel    6.916265
5      Home and lifestyle    6.837500

### ***The most widely used psyment method:***

In [12]:
query = """
SELECT 
    SUM(CASE WHEN [Payment_Credit card] = 1 THEN 1 ELSE 0 END) as CreaditCard,
    SUM(CASE WHEN [Payment_Ewallet] = 1 THEN 1 ELSE 0 END) as Ewallet
FROM transactions;
"""
pd.read_sql(query, conn)

   CreaditCard  Ewallet
0          311      345

### ***Final Insight:***

*- SQL queries reveal key business patterns directly from the dataset.*

*- These insights can then be combined with Python visualizations for deeper analysis.*